MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GM310/mcu.h
#define _RPINR19_U2RXR5_POSITION                 0x00000005
#define _RPINR19_U2RXR5_MASK                     0x00000020
#define _RPINR19_U2RXR5_LENGTH                   0x00000001

#define _RPINR19_U2RXR6_POSITION                 0x00000006
#define _RPINR19_U2RXR6_MASK                     0x00000040
#define _RPINR19_U2RXR6_LENGTH                   0x00000001

#define _RPINR22_SDI2R_POSITION                  0x00000000
#define _RPINR22_SDI2R_MASK                      0x0000007F
#define _RPINR22_SDI2R_LENGTH                    0x00000007

#define _RPINR22_SCK2R_POSITION                  0x00000008
#define _RPINR22_SCK2R_MASK                      0x00007F00
#define _RPINR22_SCK2R_LENGTH                    0x00000007

#define _RPINR22_SDI2R0_POSITION                 0x00000000
#define _RPINR22_SDI2R0_MASK                     0x00000001
#define _RPINR22_SDI2R0_LENGTH                   0x00000001

#define _RPINR22_SDI2R1_POSITION                 0x00000001
#define _RPINR22_SDI2R1_MASK                     0x00000002
#define _RPINR22_SDI2R1_LENGTH                   0x00000001

#define _RPINR22_SDI2R2_POSITION                 0x00000002
#define _RPINR22_SDI2R2_MASK                     0x00000004
#define _RPINR22_SDI2R2_LENGTH                   0x00000001

#define _RPINR22_SDI2R3_POSITION                 0x00000003
#define _RPINR22_SDI2R3_MASK                     0x00000008
#define _RPINR22_SDI2R3_LENGTH                   0x00000001

#define _RPINR22_SDI2R4_POSITION                 0x00000004
#define _RPINR22_SDI2R4_MASK                     0x00000010
#define _RPINR22_SDI2R4_LENGTH                   0x00000001

#define _RPINR22_SDI2R5_POSITION                 0x00000005
#define _RPINR22_SDI2R5_MASK                     0x00000020
#define _RPINR22_SDI2R5_LENGTH                   0x00000001

#define _RPINR22_SDI2R6_POSITION                 0x00000006
#define _RPINR22_SDI2R6_MASK                     0x00000040
#define _RPINR22_SDI2R6_LENGTH                   0x00000001

#define _RPINR22_SCK2R0_POSITION                 0x00000008
#define _RPINR22_SCK2R0_MASK                     0x00000100
#define _RPINR22_SCK2R0_LENGTH                   0x00000001

#define _RPINR22_SCK2R1_POSITION                 0x00000009
#define _RPINR22_SCK2R1_MASK                     0x00000200
#define _RPINR22_SCK2R1_LENGTH                   0x00000001

#define _RPINR22_SCK2R2_POSITION                 0x0000000A
#define _RPINR22_SCK2R2_MASK                     0x00000400
#define _RPINR22_SCK2R2_LENGTH                   0x00000001

#define _RPINR22_SCK2R3_POSITION                 0x0000000B
#define _RPINR22_SCK2R3_MASK                     0x00000800
#define _RPINR22_SCK2R3_LENGTH                   0x00000001

#define _RPINR22_SCK2R4_POSITION                 0x0000000C
#define _RPINR22_SCK2R4_MASK                     0x00001000
#define _RPINR22_SCK2R4_LENGTH                   0x00000001

#define _RPINR22_SCK2R5_POSITION                 0x0000000D
#define _RPINR22_SCK2R5_MASK                     0x00002000
#define _RPINR22_SCK2R5_LENGTH                   0x00000001

#define _RPINR22_SCK2R6_POSITION                 0x0000000E
#define _RPINR22_SCK2R6_MASK                     0x00004000
#define _RPINR22_SCK2R6_LENGTH                   0x00000001

#define _RPINR23_SS2R_POSITION                   0x00000000
#define _RPINR23_SS2R_MASK                       0x0000007F
#define _RPINR23_SS2R_LENGTH                     0x00000007

#define _RPINR23_SS2R0_POSITION                  0x00000000
#define _RPINR23_SS2R0_MASK                      0x00000001
#define _RPINR23_SS2R0_LENGTH                    0x00000001

#define _RPINR23_SS2R1_POSITION                  0x00000001
#define _RPINR23_SS2R1_MASK                      0x00000002
#define _RPINR23_SS2R1_LENGTH                    0x00000001

#define _RPINR23_SS2R2_POSITION                  0x00000002
#define _RPINR23_SS2R2_MASK                      0x00000004
#define _RPINR23_SS2R2_LENGTH                    0x00000001

#define _RPINR23_SS2R3_POSITION                  0x00000003
#define _RPINR23_SS2R3_MASK                      0x00000008
#define _RPINR23_SS2R3_LENGTH                    0x00000001

#define _RPINR23_SS2R4_POSITION                  0x00000004
#define _RPINR23_SS2R4_MASK                      0x00000010
#define _RPINR23_SS2R4_LENGTH                    0x00000001

#define _RPINR23_SS2R5_POSITION                  0x00000005
#define _RPINR23_SS2R5_MASK                      0x00000020
#define _RPINR23_SS2R5_LENGTH                    0x00000001

#define _RPINR23_SS2R6_POSITION                  0x00000006
#define _RPINR23_SS2R6_MASK                      0x00000040
#define _RPINR23_SS2R6_LENGTH                    0x00000001

#define _RPINR24_CSDIR_POSITION                  0x00000000
#define _RPINR24_CSDIR_MASK                      0x0000007F
#define _RPINR24_CSDIR_LENGTH                    0x00000007

#define _RPINR24_CSCKR_POSITION                  0x00000008
#define _RPINR24_CSCKR_MASK                      0x00007F00
#define _RPINR24_CSCKR_LENGTH                    0x00000007

#define _RPINR24_CSDIR0_POSITION                 0x00000000
#define _RPINR24_CSDIR0_MASK                     0x00000001
#define _RPINR24_CSDIR0_LENGTH                   0x00000001

#define _RPINR24_CSDIR1_POSITION                 0x00000001
#define _RPINR24_CSDIR1_MASK                     0x00000002
#define _RPINR24_CSDIR1_LENGTH                   0x00000001

#define _RPINR24_CSDIR2_POSITION                 0x00000002
#define _RPINR24_CSDIR2_MASK                     0x00000004
#define _RPINR24_CSDIR2_LENGTH                   0x00000001

#define _RPINR24_CSDIR3_POSITION                 0x00000003
#define _RPINR24_CSDIR3_MASK                     0x00000008
#define _RPINR24_CSDIR3_LENGTH                   0x00000001

#define _RPINR24_CSDIR4_POSITION                 0x00000004
#define _RPINR24_CSDIR4_MASK                     0x00000010
#define _RPINR24_CSDIR4_LENGTH                   0x00000001

#define _RPINR24_CSDIR5_POSITION                 0x00000005
#define _RPINR24_CSDIR5_MASK                     0x00000020
#define _RPINR24_CSDIR5_LENGTH                   0x00000001

#define _RPINR24_CSDIR6_POSITION                 0x00000006
#define _RPINR24_CSDIR6_MASK                     0x00000040
#define _RPINR24_CSDIR6_LENGTH                   0x00000001

#define _RPINR24_CSCKR0_POSITION                 0x00000008
#define _RPINR24_CSCKR0_MASK                     0x00000100
#define _RPINR24_CSCKR0_LENGTH                   0x00000001

#define _RPINR24_CSCKR1_POSITION                 0x00000009
#define _RPINR24_CSCKR1_MASK                     0x00000200
#define _RPINR24_CSCKR1_LENGTH                   0x00000001

