MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GM310/mcu.h
#define _CMSTAT_C4OUT_POSITION                   0x00000003
#define _CMSTAT_C4OUT_MASK                       0x00000008
#define _CMSTAT_C4OUT_LENGTH                     0x00000001

#define _CMSTAT_C5OUT_POSITION                   0x00000004
#define _CMSTAT_C5OUT_MASK                       0x00000010
#define _CMSTAT_C5OUT_LENGTH                     0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000008
#define _CMSTAT_C1EVT_MASK                       0x00000100
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000009
#define _CMSTAT_C2EVT_MASK                       0x00000200
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CMSTAT_C3EVT_POSITION                   0x0000000A
#define _CMSTAT_C3EVT_MASK                       0x00000400
#define _CMSTAT_C3EVT_LENGTH                     0x00000001

#define _CMSTAT_C4EVT_POSITION                   0x0000000B
#define _CMSTAT_C4EVT_MASK                       0x00000800
#define _CMSTAT_C4EVT_LENGTH                     0x00000001

#define _CMSTAT_C5EVT_POSITION                   0x0000000C
#define _CMSTAT_C5EVT_MASK                       0x00001000
#define _CMSTAT_C5EVT_LENGTH                     0x00000001

#define _CMSTAT_PSIDL_POSITION                   0x0000000F
#define _CMSTAT_PSIDL_MASK                       0x00008000
#define _CMSTAT_PSIDL_LENGTH                     0x00000001

#define _CVR1CON_CVR_POSITION                    0x00000000
#define _CVR1CON_CVR_MASK                        0x0000000F
#define _CVR1CON_CVR_LENGTH                      0x00000004

#define _CVR1CON_CVRSS_POSITION                  0x00000004
#define _CVR1CON_CVRSS_MASK                      0x00000010
#define _CVR1CON_CVRSS_LENGTH                    0x00000001

#define _CVR1CON_CVRR0_POSITION                  0x00000005
#define _CVR1CON_CVRR0_MASK                      0x00000020
#define _CVR1CON_CVRR0_LENGTH                    0x00000001

#define _CVR1CON_CVROE_POSITION                  0x00000006
#define _CVR1CON_CVROE_MASK                      0x00000040
#define _CVR1CON_CVROE_LENGTH                    0x00000001

#define _CVR1CON_CVREN_POSITION                  0x00000007
#define _CVR1CON_CVREN_MASK                      0x00000080
#define _CVR1CON_CVREN_LENGTH                    0x00000001

#define _CVR1CON_VREFSEL_POSITION                0x0000000A
#define _CVR1CON_VREFSEL_MASK                    0x00000400
#define _CVR1CON_VREFSEL_LENGTH                  0x00000001

#define _CVR1CON_CVRR1_POSITION                  0x0000000B
#define _CVR1CON_CVRR1_MASK                      0x00000800
#define _CVR1CON_CVRR1_LENGTH                    0x00000001

#define _CVR1CON_CVR0_POSITION                   0x00000000
#define _CVR1CON_CVR0_MASK                       0x00000001
#define _CVR1CON_CVR0_LENGTH                     0x00000001

#define _CVR1CON_CVR1_POSITION                   0x00000001
#define _CVR1CON_CVR1_MASK                       0x00000002
#define _CVR1CON_CVR1_LENGTH                     0x00000001

#define _CVR1CON_CVR2_POSITION                   0x00000002
#define _CVR1CON_CVR2_MASK                       0x00000004
#define _CVR1CON_CVR2_LENGTH                     0x00000001

#define _CVR1CON_CVR3_POSITION                   0x00000003
#define _CVR1CON_CVR3_MASK                       0x00000008
#define _CVR1CON_CVR3_LENGTH                     0x00000001

#define _CVR1CON_CVRR_POSITION                   0x00000005
#define _CVR1CON_CVRR_MASK                       0x00000020
#define _CVR1CON_CVRR_LENGTH                     0x00000001

#define _CVR1CON_CVR1OE_POSITION                 0x00000006
#define _CVR1CON_CVR1OE_MASK                     0x00000040
#define _CVR1CON_CVR1OE_LENGTH                   0x00000001

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000010
#define _CM1CON_CREF_LENGTH                      0x00000001

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CEVT_POSITION                    0x00000009
#define _CM1CON_CEVT_MASK                        0x00000200
#define _CM1CON_CEVT_LENGTH                      0x00000001

#define _CM1CON_OPMODE_POSITION                  0x0000000A
#define _CM1CON_OPMODE_MASK                      0x00000400
#define _CM1CON_OPMODE_LENGTH                    0x00000001

#define _CM1CON_CPOL_POSITION                    0x0000000D
#define _CM1CON_CPOL_MASK                        0x00002000
#define _CM1CON_CPOL_LENGTH                      0x00000001

#define _CM1CON_COE_POSITION                     0x0000000E
#define _CM1CON_COE_MASK                         0x00004000
#define _CM1CON_COE_LENGTH                       0x00000001

#define _CM1CON_CON_POSITION                     0x0000000F
#define _CM1CON_CON_MASK                         0x00008000
#define _CM1CON_CON_LENGTH                       0x00000001

#define _CM1CON_CCH0_POSITION                    0x00000000
#define _CM1CON_CCH0_MASK                        0x00000001
#define _CM1CON_CCH0_LENGTH                      0x00000001

#define _CM1CON_CCH1_POSITION                    0x00000001
#define _CM1CON_CCH1_MASK                        0x00000002
#define _CM1CON_CCH1_LENGTH                      0x00000001

#define _CM1CON_EVPOL0_POSITION                  0x00000006
#define _CM1CON_EVPOL0_MASK                      0x00000040
#define _CM1CON_EVPOL0_LENGTH                    0x00000001

#define _CM1CON_EVPOL1_POSITION                  0x00000007
#define _CM1CON_EVPOL1_MASK                      0x00000080
#define _CM1CON_EVPOL1_LENGTH                    0x00000001

#define _CM1CON_CEN_POSITION                     0x0000000F
#define _CM1CON_CEN_MASK                         0x00008000
#define _CM1CON_CEN_LENGTH                       0x00000001

#define _CM1MSKSRC_SELSRCA_POSITION              0x00000000
#define _CM1MSKSRC_SELSRCA_MASK                  0x0000000F
#define _CM1MSKSRC_SELSRCA_LENGTH                0x00000004

